{
  "users": [
    {
      "email": "mark@email.com",
      "password": "$2a$10$qF6j/lS0Xavav6IHHe3wluLyTjSsbMKZ2yi2/LyOcX.P.EYTliSIK",
      "name": "mark zuckerberg",
      "id": 1
    }
  ],
  "recipes": [
    {
      "title": "Bolo de Laranja Vegano",
      "ingredients": [
        "1 laranja em cubos",
        "1/2 xícara de suco de laranja",
        "3/4 de xícara de óleo",
        "1 xícara de açúcar",
        "2 xícaras de farinha de trigo",
        "1 colher de sopa de fermento em pó",
        "Pitada de sal"
      ],
      "instructions": [
        "Bater no liquidificador a laranja, o suco, o óleo, o açúcar e o sal e reservar.",
        "Misturar em uma tigela a farinha e o fermento em pó.",
        "Incorporar a mistura do liquidificador na farinha com o fermento.",
        "Colocar a massa em uma forma untada e enfarinhada.",
        "Assar por 40 a 50 minutos em forno pré-aquecido a 180ºC."
      ],
      "category": "doce",
      "author": "Mark",
      "userId": "1",
      "id": 1
    },
    {
      "title": "Pão português (vegano)",
      "ingredients": [
        "Pão português",
        "1 colher de sobremesa de sal",
        "1/2 sachê de fermento biológico seco",
        "350ml de água morna"
      ],
      "instructions": [
        "Coloca tudo numa tigela e sova por uns 15 minutos, até a massa ficar lisa, faz um formato redondo e coloca numa tigela pra crescer e unte a massa com óleo ou azeite. ",
        "Cubra a tigela e deixe crescer por 30 minutos. ",
        "Transfira a massa pra uma superfície com um pouco de farinha e divida ela em duas, dobre a massa tipo um envelope várias vezes e faça o formato que quiser. ",
        "Coloque ela pra crescer novamente com um pouco de farinha em cima e deixe descansar por mais 30 minutos.",
        "Depois joga na forma untada com óleo, faça os cortes e leve ao forno a 200°C por 30 minutos. Tá pronto!"
      ],
      "category": "salgado",
      "author": "Mark",
      "userId": "1",
      "id": 2
    },
    {
      "title": "Cappuccino vegano",
      "ingredients": [
        "300g de leite de coco em pó",
        "2 colheres de sopa de cacau em pó",
        "1 xícara de açúcar mascavo",
        "1 colher de chá de bicarbonato de sódio",
        "2 colheres de sopa de canela"
      ],
      "instructions": [
        "Bata o café e cacau no liquidificador ou processador em potência máxima até que fique um pó bem fininho.",
        "Acrescente os demais ingredientes e processe até que se misturem.",
        "Para preparar a bebida, dilua 2-3 olheres de sopa da mistura em 250 ml de água quente.",
        "Pode ser armazenado em pote de vidro por até 1 mês."
      ],
      "category": "bebida",
      "author": "Mark",
      "userId": "1",
      "id": 3
    }
  ],
  "myRecipes": [],
  "favorites": []
}
